////斐波那契数
////1,1,2,3,5,8,13
////用递归，要求输入一个n得出第n个斐波那契数是多少
//
////分析
////n=1,2时，返回1，从n=3开始，对应的斐波那契数是前面两个数的和
///*int fbn(int n) {
//	if (n == 1 || n == 2) {
//		return 1;
//	}
//	else {
//		return fbn(n - 1) + fbn(n - 2);
//	}
//}
//#include<stdio.h>
//void main(){
//	int res = fbn(7);
//	printf("res = %d", res);
//}
//*/
////第二题
////#include<stdio.h>
////int f(int n) {
////	if (n == 1) {
////		return 3;
////	}
////	else {
////		return 2 * f(n - 1) + 1;
////	}
////}
////void main() {
////	int res = f(3);
////	printf("res = %d", res);
////}
//
//
////猴子吃桃子，第一天吃了其中的一半，并多吃了一个，
////以后每天猴子都吃其中的一半，然后再吃一个，当到第十天的时候，想再吃时，发现只有一个桃子了
////问最初有几个桃子
////第十天有1个桃子
////第九天有(day10+1)*2=4
////第八天有(day9+1)*2=10
////每天吃n/2+1,那么每天剩下的就是n/2-1,那么第n天就应该有（下一天苹果+1）×2
////这里要注意的是我们只知道第十天有1个桃子，那么我们必须去让递归逼近第十天，也就是必须逼近已知的第十天
//#include<stdio.h>
//int peach(int day) {
//	if (day == 10) {
//		return 1;
//	}
//	else {
//		return  (peach(day + 1) + 1) * 2;//2 * peach(n+1) + 2;
//	}
//}
//void main() {
//	int res = peach(9);//第九天还剩多少个桃子
//	printf("res = %d", res);
//}