////==定义一个函数，输入数字n就可以打印n层的金字塔，第一层一颗*，第二层3颗*
//
//#include<stdio.h>
//void JZT(int n ) {//定义函数返回值为空，函数名为JZT，形参为int n 的函数
//	int i, j, k;//定义三个整形变量，用来控制层数，“*”数，和空格数
//	for (i = 0; i <= n; i++) {//控制层数的迭代
//		for (k = 0; k <= n-i; k++) {//空格和层数的关系是，总层数-i（第i层）=第i层的空格
//			printf(" ");
//		}
//		for (j = 1; j <= 2 * i - 1; j++) {//控制星号在第i层的数量，第一层1个，第二层3个，第i层就是2i-1个
//			printf("*");
//		}printf("\n");//控制换行，每当第i行的星号打印完后，就换行
//	}
//
//}
//
//void main() {
//	printf("请输入你想打印金字塔的层数:");
//	int a = 0;
//	scanf_s("%d", &a);
//	JZT(a);
//	getchar();
//}